Q1. List any five functions of the pandas library with execution.

In [10]:
 ''' pd.Series()
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet.'''

import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [11]:
'''pandas. concat() function does all the heavy lifting of performing concatenation operations along with an axis od Pandas objects while performing optional set logic (union or intersection) of the indexes (if any) on the other axes.'''

s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [12]:
#axis=1 will concat by columnwise

s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2],axis=1)

   0  1
0  a  c
1  b  d

In [13]:
'''pd. get_dummies when applied to a column of categories where we have one category per observation will produce a new column (variable) for each unique categorical value. It will place a one in the column corresponding to the categorical value present for that observation.'''

list('abca')

['a', 'b', 'c', 'a']

In [14]:
s = pd.Series(list('abca'))
pd.get_dummies(s)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [15]:
'''The unique() function is used to get unique values of the Series object. Uniques are returned in order of appearance. Hash table-based unique, therefore does NOT sort.'''

pd.unique(s)

array(['a', 'b', 'c'], dtype=object)

In [16]:
'''The to_datetime() function is used to convert the argument to datetime.'''

df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
pd.to_datetime(df)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [17]:
'''The to_timedelta() function is used to convert the argument to datetime.Timedeltas are absolute differences in times, expressed in different units (e.g. days, hours, minutes, seconds). This method converts an argument from a recognized timedelta format/value into a Timedelta type.

'''

pd.to_timedelta('1day7ms')

Timedelta('1 days 00:00:00.007000')

In [18]:
'''The date_range() function is usede to get a fixed frequency DatetimeIndex.'''

pd.date_range(start='15/06/2023', end='20/06/2023')

C:\Users\manim\AppData\Local\Temp\ipykernel_23912\4183414974.py:3: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.date_range(start='15/06/2023', end='20/06/2023')

DatetimeIndex(['2023-06-15', '2023-06-16', '2023-06-17', '2023-06-18',
               '2023-06-19', '2023-06-20'],
              dtype='datetime64[ns]', freq='D')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [19]:
'''Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.'''
d = {"A":[2,3,4,5 ],
     "B":[4,5,6,7],
     "C":[2,3,4,5]}

In [20]:
df = pd.DataFrame(d)
print(df)

   A  B  C
0  2  4  2
1  3  5  3
2  4  6  4
3  5  7  5

In [21]:
    df = df.reset_index(drop=True)
    df.index = df.index.map(lambda x: x * 2 + 1)

In [22]:
print(df)

   A  B  C
1  2  4  2
3  3  5  3
5  4  6  4
7  5  7  5

In [67]:
df = pd.DataFrame(d)
#print(df)

def reindex_dataframe(df):
    df = df.reset_index(drop=True)
    df.index = df.index.map(lambda x: x * 2 + 1)
    return df
reindex_dataframe(df)

   values
1      10
3      20
5      30
7      40
9      50

In [59]:
'''Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.'''

d = {'values' : [10, 20, 30, 40, 50]}

In [60]:
df1 = pd.DataFrame(d)

In [61]:
print(df1)

   values
0      10
1      20
2      30
3      40
4      50

In [62]:
len(df1)

5

In [63]:
df2 = df1.loc[0 : 2,['values']]

df2.sum()

values    60
dtype: int64

In [68]:
def sum_index(df1):
    df2 = df1.loc[0 : 2,['values']]
    df2.sum()
    return df2

sum_index(df1)

   values
0      10
1      20
2      30

In [54]:
'''Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.'''

data = {"Text":['how','who','what','where']}

In [55]:
df3 = pd.DataFrame(data)

In [56]:
print(df3)

    Text
0    how
1    who
2   what
3  where

In [57]:
df3["word_count"] = df3['Text'].str.len()

In [58]:
print(df3)

    Text  word_count
0    how           3
1    who           3
2   what           4
3  where           5

In [69]:
def count_thestring(df3):
    df3["word_count"] = df3['Text'].str.len()
    return(df3)

count_thestring(df3)

    Text  word_count
0    how           3
1    who           3
2   what           4
3  where           5

Q5. How are DataFrame.size() and DataFrame.shape() different?

dataframe.size:
The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.

dataframe.shape:
The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

Q6. Which function of pandas do we use to read an excel file?

read_excel(file_name) is used.

In [ ]:
'''Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.'''

In [5]:
import pandas as pd
data1 = {"Email":['mani@gmail.com','mekala@gmail.com','mani2@gmail.com']}

In [6]:
df = pd.DataFrame(data1)

In [7]:
def extract_username(df):
    df['username'] = df["Email"].str.split("@").str[0]
    return(df)

extract_username(df)

              Email username
0    mani@gmail.com     mani
1  mekala@gmail.com   mekala
2   mani2@gmail.com    mani2

In [8]:
 df["Email"].str[0]

0    m
1    m
2    m
Name: Email, dtype: object

In [12]:
df["Email"].str.split("@").str[1]

0    gmail.com
1    gmail.com
2    gmail.com
Name: Email, dtype: object

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [22]:
import pandas as pd

data2 = { "A": [3,8,6,2,9], "B": [5,2,9,3,1],"C" : [1,7,4,5,2]}

In [23]:
df = pd.DataFrame(data2)

In [24]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [32]:
df[(df['A'].gt(5)) & (df['B'].lt(10))]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [33]:
def check_value(df):
    df = df[(df['A'].gt(5)) & (df['B'].lt(10))]
    return df

check_value(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [43]:
d = {'values' : [10, 20, 30, 40, 50, 60, 7, 0, 1, 2,90]}

In [44]:
df = pd.DataFrame(d)

In [45]:
df['values'].mean()

28.181818181818183

In [46]:
df['values'].median()

20.0

In [47]:
df['values'].std()

29.18498991542804

In [48]:
def calculate(df):
    print(df['values'].mean())
    print(df['values'].median())
    print(df['values'].std())
calculate(df)

28.181818181818183
20.0
29.18498991542804

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [69]:
# importing pandas as pd
import pandas as pd

# Creating the DataFrame
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011','14/2/2011','15/2/2011','16/2/2011','17/2/2011','18/2/2011','19/2/2011','20/2/2011','21/2/2011','22/2/2011','23/2/2011','24/2/2011','25/2/2011','26/2/2011','27/2/2011'],
					'sales':[450, 700, 90, 67, 5, 6,8,17,18,19,20,21,22,23,24,25,26,27]})

# Print the dataframe
print(df)

         Date  sales
0   10/2/2011    450
1   11/2/2011    700
2   12/2/2011     90
3   13/2/2011     67
4   14/2/2011      5
5   15/2/2011      6
6   16/2/2011      8
7   17/2/2011     17
8   18/2/2011     18
9   19/2/2011     19
10  20/2/2011     20
11  21/2/2011     21
12  22/2/2011     22
13  23/2/2011     23
14  24/2/2011     24
15  25/2/2011     25
16  26/2/2011     26
17  27/2/2011     27

In [70]:
def movingaverage(df):
    df['movingaverage'] = df.rolling(window=7).mean()
    return(df)

movingaverage(df)

C:\Users\manim\AppData\Local\Temp\ipykernel_18340\2393773233.py:2: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df['movingaverage'] = df.rolling(window=7).mean()

         Date  sales  movingaverage
0   10/2/2011    450            NaN
1   11/2/2011    700            NaN
2   12/2/2011     90            NaN
3   13/2/2011     67            NaN
4   14/2/2011      5            NaN
5   15/2/2011      6            NaN
6   16/2/2011      8     189.428571
7   17/2/2011     17     127.571429
8   18/2/2011     18      30.142857
9   19/2/2011     19      20.000000
10  20/2/2011     20      13.285714
11  21/2/2011     21      15.571429
12  22/2/2011     22      17.857143
13  23/2/2011     23      20.000000
14  24/2/2011     24      21.000000
15  25/2/2011     25      22.000000
16  26/2/2011     26      23.000000
17  27/2/2011     27      24.000000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [71]:
data = pd.date_range(start = '2022-03-22' ,end = '2022-06-22')

In [72]:
data

DatetimeIndex(['2022-03-22', '2022-03-23', '2022-03-24', '2022-03-25',
               '2022-03-26', '2022-03-27', '2022-03-28', '2022-03-29',
               '2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06',
               '2022-04-07', '2022-04-08', '2022-04-09', '2022-04-10',
               '2022-04-11', '2022-04-12', '2022-04-13', '2022-04-14',
               '2022-04-15', '2022-04-16', '2022-04-17', '2022-04-18',
               '2022-04-19', '2022-04-20', '2022-04-21', '2022-04-22',
               '2022-04-23', '2022-04-24', '2022-04-25', '2022-04-26',
               '2022-04-27', '2022-04-28', '2022-04-29', '2022-04-30',
               '2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04',
               '2022-05-05', '2022-05-06', '2022-05-07', '2022-05-08',
               '2022-05-09', '2022-05-10', '2022-05-11', '2022-05-12',
               '2022-05-13', '2022-05-14', '2022-05-15', '2022-05-16',
               '2022-05-17', '2022-05-18', '2022-05-19', '2022-05-20',
               '2022-05-21', '2022-05-22', '2022-05-23', '2022-05-24',
               '2022-05-25', '2022-05-26', '2022-05-27', '2022-05-28',
               '2022-05-29', '2022-05-30', '2022-05-31', '2022-06-01',
               '2022-06-02', '2022-06-03', '2022-06-04', '2022-06-05',
               '2022-06-06', '2022-06-07', '2022-06-08', '2022-06-09',
               '2022-06-10', '2022-06-11', '2022-06-12', '2022-06-13',
               '2022-06-14', '2022-06-15', '2022-06-16', '2022-06-17',
               '2022-06-18', '2022-06-19', '2022-06-20', '2022-06-21',
               '2022-06-22'],
              dtype='datetime64[ns]', freq='D')

In [102]:
df7 = pd.DataFrame({"date":['2023-07-01','2023-07-02','2023-07-03']})

In [103]:
df7.dtypes

date    object
dtype: object

In [104]:
df7

         date
0  2023-07-01
1  2023-07-02
2  2023-07-03

In [105]:
df7['date'] = pd.to_datetime(df7['date'])

In [106]:
df7

        date
0 2023-07-01
1 2023-07-02
2 2023-07-03

In [107]:
df7['weekday'] = df7['date'].dt.day_name()

In [108]:
df7

        date   weekday
0 2023-07-01  Saturday
1 2023-07-02    Sunday
2 2023-07-03    Monday

In [111]:
def weekday(df7):
    df7['weekday'] = df7['date'].dt.day_name()
    return df7
weekday(df7)

        date   weekday
0 2023-07-01  Saturday
1 2023-07-02    Sunday
2 2023-07-03    Monday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [123]:
df1 = pd.DataFrame({"date":['2023-07-01','2023-07-02','2023-01-03','2023-01-04','2023-01-07','2023-01-10','2023-07-03']})

In [124]:
df1.dtypes

date    object
dtype: object

In [125]:
df1['date'] = pd.to_datetime(df1['date'])

In [126]:
df1

        date
0 2023-07-01
1 2023-07-02
2 2023-01-03
3 2023-01-04
4 2023-01-07
5 2023-01-10
6 2023-07-03

In [131]:
df1['date'] = df1[df1['date'].dt.month==1]

In [132]:
df1

        date
0        NaT
1        NaT
2 2023-01-03
3 2023-01-04
4 2023-01-07
5 2023-01-10
6        NaT

In [133]:
def selectrows(df1):
    df1['date'] = df1[df1['date'].dt.month==1]
    return df1
selectrows(df1)

        date
0        NaT
1        NaT
2 2023-01-03
3 2023-01-04
4 2023-01-07
5 2023-01-10
6        NaT

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Pandas and numpy are the necessary library.